---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkLoadResultType.CouldNotChangeViewReference
enum: Autodesk.Revit.DB.LinkLoadResultType
source: html/11b095e1-24d9-91b9-ae2e-004f67c94d6e.htm
---
# Autodesk.Revit.DB.LinkLoadResultType.CouldNotChangeViewReference

The link previously had an invalid view reference and either
 no new view was provided or the input view was not usable
 for linking CAD files.